# PanelConfiguration Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..PanelConfiguration Property
PanelScheduleData Class See Also
---
The panel configuration of this panel schedule
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PanelConfiguration PanelConfiguration { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PanelConfiguration As PanelConfiguration
	Get
```

Visual C++
---
```text
public:
property PanelConfiguration PanelConfiguration {
	PanelConfiguration get ();
}
```

# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace